## Plan Result (prod_global)




<pre><code>Plan: 10 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_C[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_C[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;sptribs-dss-update-case-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sptribs-dss-update-case-web&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;cui-ra&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;cui-ra&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + expiration_date          = (known after apply)
      + host_name                = "update.special-tribunals.service.gov.uk"
      + id                       = (known after apply)
      + name                     = "sptribs-dss-update-case-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/sptribsdssupdatecaseweb-managed-secret"
          + certificate_type        = "CustomerCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain_www["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain_www" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + expiration_date          = (known after apply)
      + host_name                = "www.update.special-tribunals.service.gov.uk"
      + id                       = (known after apply)
      + name                     = "wwwsptribs-dss-update-case-web"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/secrets/sptribsdssupdatecaseweb-managed-secret"
          + certificate_type        = "CustomerCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_C["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_C" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["cui-ra"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/cuiraprodPremium"
        name                              = "cuiraprodPremium"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (9 unchanged attributes hidden)

      ~ managed_rule {
            # (3 unchanged attributes hidden)

          ~ exclusion {
              ~ selector       = "dtCookie" -> "cui-ra-cookie-preferences"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ operator       = "Equals" -> "StartsWith"
              ~ selector       = "dtLatC" -> "_ga_"
                # (1 unchanged attribute hidden)
            }
          ~ exclusion {
              ~ selector       = "dtPC" -> "dtCookie"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "dtSa" -> "dtLatC"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "rxVisitor" -> "dtPC"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ selector       = "rxvt" -> "dtSa"
                # (2 unchanged attributes hidden)
            }
          ~ exclusion {
              ~ match_variable = "QueryStringArgNames" -> "RequestCookieNames"
              ~ selector       = "rf" -> "rxVisitor"
                # (1 unchanged attribute hidden)
            }
          + exclusion {
              + match_variable = "RequestCookieNames"
              + operator       = "Equals"
              + selector       = "rxvt"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "rf"
            }

            # (2 unchanged blocks hidden)
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web/origins/sptribs-dss-update-case-web",
        ]
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "sptribs-dss-update-case-web"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]

      + cache {
          + compression_enabled           = false
          + query_string_caching_behavior = "UseQueryString"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "sptribs-dss-update-case-webHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_C["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_C" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/afdEndpoints/hmcts-prod"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/originGroups/sptribs-dss-update-case-web/origins/sptribs-dss-update-case-web",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod/ruleSets/sptribsdssupdatecasewebwwwredirectruleset",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = true
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "sptribs-dss-update-case-webwwwRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod"
      + id                       = (known after apply)
      + name                     = "sptribsdssupdatecasewebprodPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sptribsdssupdatecasewebprodPremium"

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["cui-ra"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "public_dns_record" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/manage-your-support-for-hmcts-services.service.gov.uk/TXT/_dnsauth"
        name                = "_dnsauth"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "2ps1j2h041pfjf76s74vr85n9fzssdtv"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sptribs-dss-update-case-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.update"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "special-tribunals.service.gov.uk"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/hmcts-prod|fd-log-analytics-logs-sa"
        name                           = "fd-log-analytics-logs-sa"
        # (6 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 10 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2129,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->